<?php 


$var = '
বাংলাদেশের জাতীয় সংসদের প্রথম নির্বাচন কবে অনুষ্ঠিত হয়?~1~৭ মার্চ ১৯৭৩ খৃঃ~৭ এপ্রিল ১৯৭৩ খৃঃ~১৬ ডিসেম্বর ১৯৭২ খৃঃ~৭ ডিসেম্বর ১৯৭২ খৃঃ~1,
বাংলাদেশ ও বার্মার সীমান্তবর্তী নদী কোনটি?~3~গোমতী~জিঞ্জিরাম~নাফ~কর্ণফুলী~1,
বঙ্গবন্ধু শেখ মুজিবুর রহমান কত তারিখে জন্মগ্রহণ করেন?~2~১ মার্চ ১৯১৯ খৃঃ~১৭ মার্চ ১৯২০ খৃঃ~১৪ আগস্ট ১৯৪৭ খৃঃ~২১ জুন ১৯৪১ খৃঃ~1,
আয়তনে পৃথিবীর সবচেয়ে ছোট দেশ ?~2~ফিজি~ভ্যাটিকান~কুয়েত~মালদ্বীপ~1,
মামুন 240 টাকায় একই রকম কলম কিনে দেখল যে, যদি সে একটি কলম বেশি পেত তাহলে কলমের মূল্য 1 টাকা কম পড়ত। সে কতগুলি কলম কিনেছিল?~3~13টি~14টি~15টি~16টি~1,
হাড় ও দাঁতকে মজবুত করে ---~4~আয়োডিন~আয়রন~ম্যাগনেসিয়াম~ক্যালসিয়াম  ও ফসফরাস~1,
গাড়ীর ব্যাটারিতে কোন এসিড ব্যবহার হয় ?~2~নাইট্রিক~সালফিউরিক~হাইড্রোক্লোরিক~পারক্লোরিক~1,
বাংলাদেশ উন্নয়ন ফোরামের সমন্বয়কারী কোন সংস্থা?~2~এ,ডি,বি~বিশ্বব্যাংক~জাইকা~আই,এম,এফ~1,
ইউরিয়া সার থেকে উদ্ভিদ কি খাদ্য উপাদান গ্রহান করে ?~2~ফসফরাস~নাইট্রোজেন~পটাশিয়াম~সালফার~1,
কোপেন হেগে কোন দেশের রাজধানী ?~1~ডেনমার্ক~বেলজিয়াম~ভিয়েতনাম~আর্মেনিয়া~1,
বাংলাদেশ টেলিভিশনের যাত্রা শুরু হয় কত সনে?~3~১৯৪৭ খৃঃ~১৯৫৮ খৃঃ~১৯৬৪ খৃঃ~১৯৬৫ খৃঃ~1,
বাংলা সাহিত্যের জনক হিসেবে কার নাম চিরস্মরণীয়?~-1~মাইকেল মধুসূদন দত্ত~রাজা রামমোহন রায়~ঈশ্বরচন্দ্র বিদ্যাসাগর~বঙ্কিমচন্দ্র চট্টোপাধ্যায়~1,
In cricket game the  length of pitch between the two wickets is---~1~21 yards~22 yards~23 yards~24 yards~1,
কোন খাদ্যে প্রোটিন বেশি?~2~ভাত~গরুর মাংস~মসুর ডাল~ময়দা~1,
চিরস্থায়ী বন্দোবস্ত প্রবর্তন করা হয় কত সনে?~4~১৭৫৭ খৃঃ~১৭৭০ খৃঃ~১৮৫৭ খৃঃ~১৭৯৩ খৃঃ~2,
‘চর্যাপদ’ কত সালে আবিস্কৃত হয়?~3~১৮০০~১৮৫৭~১৯০৭~১৯০৯~2,
Fil in the blank of the following sentence with the right form of verb. If i — a king!~3~am~was~were~shall be~2,
Meaden speech means-~1~First speech~Middle speech~Maid servants~Final speech~2,
 A= {1,2,3} B= fহলে AÈB =  কত?~1~{1,2,3,}~{1,2, f}~{2,3, f}~f~2,
‘তুমি আসবে বলে হে স্বাধীনতা’ -কার কবিতা?~4~শওকত ওসমান~সিকান্দার আবু জাফর~সুফিয়া কামাল~শামসুর রাহমান~2,
নবায়নযোগ্য জ্বালানী কনটি ?~1~পরমাণু শক্তি~কয়লা~পেট্রোল~প্রাকৃতিক গ্যাস প্রয়োগ~2,
Dengue fever is spread by ---~2~Rats and squirrels~Aedes aegypti mosquito~Common house flies~Anophilies mosquito~2,
১৭দিনআগেআব্দুররহিমবলেছিলযেতারজন্মদিন“আগামিকাল।আজ২৩তারিখহলেটারজন্মদিনকোনতারিখে?~1~৭ ~৮ ~৯ ~১০ ~2,
সুনামীর কারণ হল---~4~আগ্নেয়গিরির অগ্ন্যুতপাত~ঘূর্ণীঝর~চন্দ্র ও সূর্যের আকর্ষণ~সমুদ্রের তলদেশে ভূমিকম্প~2,
তিনটি ক্রমিক সংখ্যার গুনফল তাদের যোগফলের ৫ গুণ ; সংখ্যা তিনটির গড় কত ?~4~৬~৩~৫~৪  ~2,
মধ্যযুগের কবি নন কে?~1~জয়নন্দী~বড় চণ্ডীদা~গোবিন্দ দাস~জ্ঞান দাস~2,
Badminton is the national sport of ---~3~China~Scotland~Malaysia~Nepal~2,
প্রাকৃতিক কোন উৎস হতে সবচেয়ে বেশি মৃদু পানি পাওয়া যায় ?~4~নদী~সাগর~হ্রদ~বৃষ্টিপাত~2,
সৈয়দ মুজতবা আলীর প্রবন্ধ গ্রন্থ কোনটি? ~1~পঞ্চতর~কালান্তর~প্রবন্ধ সংগ্রহ~শাশ্বত বঙ্গ~2,
১৯৭১ সনের কত তারিখে মুজিবনগরে স্বাধীন বাংলাদেশের অস্থায়ী সরকার গঠিত হয়?~3~৭ মার্চ ১৯৭১ খৃঃ~২৬ মার্চ ১৯৭১ খৃঃ~১০ এপ্রিল ১৯৭১ খৃঃ~১৬ ডিসেম্বর ১৯৭১ খৃঃ~3,
x + y = 2, x2 + y2 = 4 হলে x3 + y3= কত?~1~8 ~9 ~16 ~25 ~3,
আরব বসন্ত বলতে কি বুঝায় ?~1~আরবের বিভিন্ন দেশ গণজাগরণ~আরব আঞ্চলে বসন্তকাল~আরব রাজতন্ত্র~আরবীয় মহিলাদের ক্ষমতায়~3,
একটি বৃতের পরিধি ও ক্ষেত্রফল যথাক্রমে ১৩২ সেন্টিমিটার ও ১৩৮৬ বর্গমসেন্টিমিটার |  বৃত্তটিরবৃত্ততমজ্যা– এরদৈর্ঘ্য কত ?~2~৬৬ সেন্টিমিটার~৪২ সেন্টিমিটার~২১ সেন্টিমিটার~২২ সেন্টিমিটার~3,
‘নীলদর্পণ’ নাটকটির বিষয়বস্তু কি?~1~নীলকরদের অত্যাচার~ভাষা আন্দোলন~অসহযোগ আন্দোলন~তে-ভাগা আন্দোলন~3,
লয়াজিরগা কোন দেশের আইন সভা ?~4~ফিজি~সিরিয়া~লাবানন~আফগানিস্তান~3,
ঘড়িতে এখন ৮টা বাজে, ঘন্টার কাঁটা ও মিনিটের কাঁটার মধ্যকার কোনটি হলো—~4~১৫০°~৬০°~৯০°~১২০°~3,
পানির জীব হয়ও বাতাসে নিঃশ্বাস নেয় ----~3~পটক মাছ~হাঙ্গর~শুশুক~জেলী ফিস~3,
শূন্যস্থানে সংখ্যাটি কত হবে ?~3~0.96~1. 48~1. 92~1.6~3,
Tiger : Zoology : Mars:-~3~Astrology~Cryptology~Astrology~Telescopy~3,
IMF (International monetary fund ) is the result of ---~4~Hawana Conference~Greneva conference~Rome conference~Brettonwood conference~3,
কোনটি D-8 ভুক্ত দেশ নয় ?~2~নাইজেরিয়া~ভারত~মালয়েশিয়া~তুরস্ক~3,
বাংলাদেশে শেয়ারবাজার কার্যক্রম কোন সংস্থা নিয়ন্ত্রন করে?~4~অর্থমন্ত্রনালয়~প্রধানমন্ত্রীর কার্যালয়~বাংলাদেশ ব্যাংক~সিকিউরিটিজ এক্সচেঞ্জ~3,
Photosynthesis takes place in ---~1~Green parts of the plants~Stems of the plants~Roots of the plants~. All parts of the plants~3,
কোন ডালের সংগে ল্যাথারাইজম রোগের সম্পর্ক আছে ?~3~অড়হর~ছোলা~খেসারী~মটর~3,
সুষম খাদ্যর উপাদান  কয়টি ?~2~৪ টি~৬ টি~৫ টি~৮ টি~4,
একটি আয়তাকার কক্ষের ক্ষেত্রফল ১৯২ বর্গমিটার। এর দৈর্ঘ্য ৪ মিটার কমালে এবং প্রস্থ ৪ মিটার বাড়ালে ক্ষেত্রফল অপরিবর্তিত থাকে । আয়তকার কক্ষের সমান পরিসীমাবিশিষ্ট বর্গাকার কক্ষের ক্ষেত্রফল কত হবে?~4~২২৫ বর্গমিটার~১৪৪  বর্গমিটার~১৬৯  বর্গমিটার~১৯৬  বর্গমিটার  ~4,
নিচের কোনটি বিদ্যুৎ পরিবাহিতা সবচেয়ে বেশি ?~2~তামা~রূপা~সোনা~কার্বন~4,
মুক্তিযুদ্ধভিত্তিক উপন্যাস কোনটি?~3~কৃতদাসের হাসি~মাটি আর অশ্রু~হাঙর নদীর গ্রেনেড~সারেং বউ~4,
“তাহরির স্কয়ার” কোথায় অবস্থিত?~3~সিউল~আম্মান~কায়রো~তেহরান~4,
ঘড়িতে এখন ৮ টা বাজে ঘণ্টার কাঁটা ও মিনিটের কাঁটার মধ্যকার কোণ হোল ----~4~১৫০o~৬০ o~৯০ o ~১২০ o~4,
. ~2~4~8~5~7~4,
ইনসুলিন নিংসৃত হয় কোথা থেকে ?~1~অগ্ন্যাশয় হতে~প্যাক্রিয়াস হতে~লিভার হতে~পিটুইটারী গ্লান্ড হতে~4,
রক্তে হিমোগ্লোবিনের কাজ কি ?~1~অক্সিজেন পরিবহন করা~রোগ প্রতিরোধ করা~রক্ত জমাট বাধতে সাহায্য করা~উপরে উল্লিখিত সব কয়টি~4,
মানবদেহে শক্তি উৎপাদনের প্রধান উৎস ---~3~পরিপাক~খাদ্য গ্রহন~শ্বসন~রক্ত~4,
একটি শ্রেনীতে যতজন ছাত্র – ছাত্রী আছে প্রত্যেকে তত পয়সার চেয়ে আরও ২৫ পয়সা বেসি করে চাঁদা দেওয়ায় মোট ৭৫ টাকা উঠল । ঐ শ্রেনীর ছাত্র – ছাত্রীর সংখা কত ?~3~৭০~৮৫~৭৫~১০০~4,
For Which of the following disciplines Nobel prize is a awarded?~4~literature, peace and economics   ~physiology or medicine ~Physics and chemistry ~All of the above~4,
The term PC means ---~1~Personal computer~Prime computer~Private computer~Professional computer~4,
‘ঘরে বাইরে’ উপন্যাসটি কার লেখা?~4~আলাউল~কাজী দীণ মহম্মদ~কাজী মোতাহার হোসেন~রবীন্দ্রনাথ ঠাকুর~4,
২০ ফুট লম্বা একটি বাঁশ এমনভাবে কেটে দু’ভাগ করা হলো যেন ছোট অংশ বড় অংশের দুই তৃতীয়াংশ হয় , ছোটঅংশের দৈর্ঘ্য কত ফুট ?~1~৮~৭~৬~৯~4,
পরমাণুর নিউক্লিয়াসে কি কি থাকে ?~1~নিউট্রন ও  প্রোটন~ইলেকট্রন ও প্রোটন~নিউট্রন ও পজিট্রন~ইলেকট্রন ও পজিট্রন~5,
মানবদেহে শক্তি উৎপাদনের প্রধান উৎস ---       ~3~পরিপাক~খাদ্য গ্রহন~শ্বসন~রক্ত সংবহন~5,
প্রণদ : জল :: মহীজ:?~3~সম্বর~গ্রহ~নি:সর্গ~অশ্ব~5,
N. B. stand for-~4~Note before~No bar~None bar~Nota bene~5,
বিষমবাহু DABC – এর বাহুগুলির মান অমনভাবে নির্ধারিত যে AD মধ্যমা দ্বারা গঠিত  DABD  এর ক্ষত্রফল X  বর্গমিটার । DABC – এরক্ষেত্রফল  কত ?~2~x2  বর্গমিটার~2x বর্গমিটার~( )2   বর্গমিটার~()2বর্গমিটার~5,
ফোর্ট উইলিয়াম কলেজের অধ্যক্ষ কে ছিলেন?~1~উইলিয়ম কেরি~লর্ড ওয়েলসলি~মৃত্যুঞ্জয় বিদ্যালঙ্কার~রামরাম বসু~5,
ক  খ – এর পুত্র । খ এবং গ পরস্পর বোন । ঘ হচ্ছে গ এর মা , চ, ঘ – এর পুত্র । চ – এর সংগে ক – এর সম্পর্ক কি ?~1~ক এর মামা চ~ক এর খালু চ~চ এর নানা ক~কা এর চাচা চ~5,
কোন সংখার 0.1 ভাগ এবং 0.1 ভাগের মধ্যে পার্থক্য 1.0 হলে, সংখ্যাটি কত ?~3~10 ~9~90 ~100~5,
কোন কাব্যটি পল্লী কবি জসীম উদ্দীন রচিত?~2~চৈতালী~রাখালী~ফনিমনসা~আলো পৃথিব~5,
বাংলা সাহিত্যের গঠন-পঠনের সুবিধার জন্য বাংলা সাহিত্যের ইতিহাসকে তিনটি যুগে ভাগ করা হয়েছে- বাংলা সাহিত্যের প্রাচীণ যুগ।~3~৮৫০ — ৬৫০~৬৫০ — ৮৫০~৬৫০ — ১২০০~৬৫০ — ১২৫০~5,
মাইকেল মধুসূদন দত্তের রচনা নয় কোনটি?~3~তিলোত্তমা কাব্য~মেঘনাদ বধ কাব্য~বেতাল পঞ্চবিংশতি~বীরাঙ্গনা~5,
প্রানী জগতের উৎপত্তি ও বংশ সম্মন্ধীয় বিদ্যাকে বলে---~3~জুওলজী~বায়োলজী~ইভোলিউশন~জেনেতিক্স~5,
নিম্নের কোন সংস্থাটি ২১শে ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে স্বীকৃতি দিয়েছে?~2~UNDP~UNESCO~UNICEF~UNCTAD~5,
বরফ পানিতে ভাসে কারণ বরফের তুলনায় পানির ---~2~ঘনত্ব কম~ঘনত্ব বেসি~তাপমাত্রা বেসি~দ্রবণীয়তা বেসি~5,
Lunar eclipse occurs on---~2~A half moon day~A full moon day~A new moon day~A moonless day~5,
ডায়াবেটিস রোগ সম্পর্কে যে তথ্যতিন সঠিক নয় তা হল ---~2~এরোগে মানবদেহের কিডনি নষ্ট করে~চিনি জাতীয় খাবার খেলে এ রোগ হয়~এ রোগ হলে রুক্তে গ্লুকোজের পরিমাণ বৃদ্ধি পায়~ইনসুলিনের অভাবে এ রোগ হয়~6,
Botany is to plants as Zoology is to-~4~Flowers~Rivers~Mountains~Animals~6,
ভাষা আন্দোলনভিত্তিক নাটক কোনটি?~1~কবর~পায়ের আওয়াজ পাওয়া যায়~জন্ডিস ও বিবিধ বেলুন~ওরা কদম আলী~6,
‘ভানুসিংহ ঠাকুর’ কার ছদ্ম নাম?~2~দীনবন্ধু মিত্র~রবীন্দ্রনাথ ঠাকুর~প্রমথ চৌধুরী~জীবনানন্দ দাস~6,
বাংলা সাহিত্যের অন্ধকার যুগ বলতে-~2~১১৯৯-১২৫০ পর্যন্ত~১২০১-১৩৫০ পর্যন্ত~১২৫০-১৩৫০ পর্যন্ত~১২৫০-১৪৫০ পর্যন্ত~6,
ইদানিং আপনার মনে হছে সংসারে আপনার গুরুত্ব হ্রাস পাচ্ছে । আপনি এমন আবস্থায়----~3~খুবই হতাশাবোধ করবেন~বন্ধুদের সাথে বিষয়টি আলাপ করবেন~সংসারের প্রতি গভীর মনোযোগ দেবেন~ক্ষোভ ও দুঃখ প্রকাশ করে মন খারাপ করবেন~6,
আশিয়ার হিন্দু রাষ্ট্র কনটি ?~2~নেপাল~ভারাত~ভূটান~মালদ্বীপ~6,
Who is known as the Lady of the lamp?~1~Florence Nightingale~Hellen Killer ~sorojini naidu ~Madame Teresa~6,
‘আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি আমি কি ভুলিতে পারি’। - এ গানের প্রথম সুরকার কে?~4~আবদুল গফ্ফার চৌধুরী~আসাদ চৌধুরী~আলতাফ মাহমুদ~আব্দুল লতিফ~6,
একটি পঞ্চভুজের সমষ্টি -----~2~৪ সমকোণ~৬ সমকোণ~৮ সমকোণ~১০ সমকোণ~6,
‘তত্ত্ববোধিনী’ পত্রিকার সম্পাদক কে ছিলেন?~1~অক্ষয়কুমার দত্ত~প্যারীচাঁদ মিত্র~ঈশ্বরচন্দ্র বিদ্যাসাগর~সৈয়দ মুজতবা আলী~6,
√169 equal to—~2~11~13~12~15~6,
World ‘no-Tobacco Day’ is observed on –~4~May30~May 28  ~May 25~May31~6,
বহুল আলোচিত মুহুরীর চর কোন জেলায় অবস্থিত?~2~নোয়াখালী~ফেনী~লালমনিরহাট~সাতক্ষিরা~6,
আমার কক্ষে এক বৃদ্ধ দম্পতি ও তাদের সাথে দুই দম্পতি প্রত্যেকে দুইজন করে সন্তানসহ আমার কক্ষে প্রবেশ করল । আমার কক্ষে মোট কতজন লোক হ’ল ?~3~৯~১০~১১~১২~6,
EURO is the currency of ---~3~Africa~America~Europe~Asia~7,
কুলীন কুল সর্বস্ব নাটকটি কার লেখা?~4~মাইকেল মধুসূদন দত্ত~দীনবন্ধু মিত্র~রামনারায়ণ তর্করত্ন~রবীন্দ্রনাথ ঠাকুর~7,
১৯৮৫ সালে নাসির উদ্দিন স্বর্ণ পদক কে পান?~1~সৈয়দ আলী আহসান~সৈয়দ ওয়ালীউল্লাহ~সৈয়দ শামসুল হক~সিকান্দার আবু জাফর~7,
The international court of Justice is located in ----~1~Hague~Geneva~London~New York~7,
Which none of the following ecosystems covers the largest area of the earth’s surface?~1~ Marine Ecosystem~Fresh water Ecosystem~Desert Ecosystems~Mountain Ecosystem~7,
What is the masculine gender of mare?~3~Mermaid~Bear~Stalion~Dog~7,
জামাল নজরুল ইসলাম কে?~4~ফুটবল খেলোয়াড়~অর্থনীতিবিদ~কবি~বৈজ্ঞানিক~7,
‘দেয়াল’ রচনাটি কার?~1~হুমায়ুন আহমেদ~তারাশঙ্কর বন্দ্যোপাধ্যায়~বুদ্ধদেব বসু~সেলিনা হোসেন~7,
অ্যামনেস্টি ইন্টরন্যাশনাল এর সদর দপ্তর কোথয় অবস্থিত ?~1~লন্ডন ~নিউইয়র্ক~প্যারিস~ভিয়েনা~7


';
	
	$arr = array();
	
	foreach( explode(",", $var) as $serial => $qs_single ) {
		
		$arr_qs 	= explode('~',$qs_single);
		$correct 	= isset( $arr_qs[1] ) ? $arr_qs[1] : '';
		$option_1 	= isset( $arr_qs[2] ) ? $arr_qs[2] : '';
		$option_2 	= isset( $arr_qs[3] ) ? $arr_qs[3] : '';
		$option_3 	= isset( $arr_qs[4] ) ? $arr_qs[4] : '';
		$option_4 	= isset( $arr_qs[5] ) ? $arr_qs[5] : '';
			
		if( 
			!empty( $arr_qs[0] ) &&
			!empty( $correct ) &&
			!empty( $option_1 ) &&
			!empty( $option_2 ) &&
			!empty( $option_3 ) &&
			!empty( $option_4 ) )
		{
			$new_question_post = array(
				'post_type'   => 'question',
				'post_title'    => $arr_qs[0],
				'post_status'   => 'pending',
			  
			);
			$post_id = wp_insert_post($new_question_post, true);
			
			update_post_meta($post_id,'question_option_1',$option_1);
			update_post_meta($post_id,'question_option_2',$option_2);
			update_post_meta($post_id,'question_option_3',$option_3);
			update_post_meta($post_id,'question_option_4',$option_4);
			update_post_meta($post_id,'question_correct_ans',$correct);
			update_post_meta($post_id,'question_level',rand(1,6));
			
			
			
			
			/*$arr[ $arr_qs[0] ] = array(
				
				'option_1' 	=> $option_1,
				'option_2' 	=> $option_2,
				'option_3' 	=> $option_3,
				'option_4' 	=> $option_4,
				'correct' 	=> $correct,
				'level' 	=> rand(1,10),
				
			); */
		}
	}
	
	echo '<pre>';print_r($count);echo '</pre>';


?>
